Repository: Magneticdud/GlucoSnap
Catalog: locale/*/LC_MESSAGES/django.po
Languages: it

source: Glucose level must be between 20 and 600 mg/dL.
it: Il livello di glucosio deve essere compreso tra 20 e 600 mg/dL.

source: Italian
it: Italiano

source: English
it: Inglese

source: Diagnosis Date
it: Data Diagnosi

source: Target Glucose Min (mg/dL)
it: Glucosio Minimo Target (mg/dL)

source: Target Glucose Max (mg/dL)
it: Glucosio Massimo Target (mg/dL)

source: Language Preference
it: Preferenza Lingua

source: Fasting
it: Digiuno

source: Pre Breakfast
it: Pre Colazione

source: Post Breakfast
it: Post Colazione

source: Pre Lunch
it: Pre Pranzo

source: Post Lunch
it: Post Pranzo

source: Pre Dinner
it: Pre Cena

source: Post Dinner
it: Post Cena

source: Bedtime
it: Ora di Coricarsi

source: Night
it: Notte

source: Timestamp
it: Data/Ora

source: Glucose Level (mg/dL)
it: Livello Glucosio (mg/dL)

source: Measurement Type
it: Tipo Misurazione

source: Notes
it: Note

source: Glucose Reading
it: Lettura Glucosio

source: Glucose Readings
it: Letture Glucosio

source: Breakfast
it: Colazione

source: Lunch
it: Pranzo

source: Dinner
it: Cena

source: Snack
it: Spuntino

source: Meal Type
it: Tipo Pasto

source: Description
it: Descrizione

source: AI generated description
it: Descrizione generata dall'AI

source: Photo
it: Foto

source: Estimated Calories
it: Calorie Stimate

source: Carbs Estimate (g)
it: Stima Carboidrati (g)

source: Manual Notes
it: Note Manuali

source: AI Response Raw
it: Risposta AI Grezza

source: Meal
it: Pasto

source: Meals
it: Pasti

source: OpenAI API key not configured.
it: Chiave API OpenAI non configurata.

source: Glucose reading added successfully.
it: Lettura glucosio aggiunta con successo.

source: AI Analysis complete. Please review the details.
it: Analisi AI completata. Si prega di rivedere i dettagli.

source: Meal added successfully.
it: Pasto aggiunto con successo.

source: Language changed successfully.
it: Lingua cambiata con successo.

source: Add Meal
it: Aggiungi Pasto

source: Meal History
it: Cronologia Pasti

source: Logout
it: Esci

source: Add Glucose
it: Aggiungi Glucosio

source: Glucose History
it: Cronologia Glucosio

source: Reports
it: Report

source: Export Excel
it: Esporta Excel

source: PDF Report
it: Report PDF

source: Add Glucose Reading
it: Aggiungi Lettura Glucosio

source: Save Reading
it: Salva Lettura

source: Cancel
it: Annulla

source: Upload a photo to get automatic AI analysis of your meal!
it: Carica una foto per ottenere un'analisi AI automatica del tuo pasto!

source: Save Meal
it: Salva Pasto

source: Overview of your glucose levels and meals.
it: Panoramica dei tuoi livelli di glucosio e pasti.

source: Avg Glucose (7 Days)
it: Media Glucosio (7 Giorni)

source: Glucose Trend (Last 7 Days)
it: Tendenza Glucosio (Ultimi 7 Giorni)

source: Recent Readings
it: Letture Recenti

source: No readings yet.
it: Nessuna lettura ancora.

source: View All
it: Vedi Tutto

source: Recent Meals
it: Pasti Recenti

source: No meals yet.
it: Nessun pasto ancora.

source: Glucose Level
it: Livello Glucosio

source: Add New
it: Aggiungi Nuovo

source: Date & Time
it: Data e Ora

source: Level (mg/dL)
it: Livello (mg/dL)

source: Type
it: Tipo

source: No readings found.
it: Nessuna lettura trovata.

source: Previous
it: Precedente

source: Next
it: Successivo

source: Page %(number)s of %(total)s
it: Pagina %(number)s di %(total)s

source: Calories
it: Calorie

source: Carbs
it: Carboidrati

source: No meals recorded yet.
it: Nessun pasto registrato ancora.

source: Medical Report
it: Referto Medico

source: Patient
it: Paziente

source: Generated
it: Generato

source: Summary Statistics
it: Statistiche Riepilogo

source: Average Glucose
it: Glucosio Medio

source: Standard Deviation
it: Deviazione Standard

source: Date
it: Data

source: Time
it: Ora

source: Level
it: Livello

source: Login
it: Accedi
